Config/Documents/ИнвентаризацияДрагКамнейВИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИнвентаризацияДрагКамнейВИК</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказаКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказаКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоИнвентаризации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МестоИнвентаризацииНФА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнвентаризацииДрагМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборДрагоценныйМатериал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрагМеталлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инвентаризация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНФА</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДрагМатериала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаДМУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДМУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаДМФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДМФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияДрагМатериала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccumulationRegisters/СтоимостьОбъектовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьОбъектовОС</Name>
			<Comment>Стоимость и количество объектов на счетах 101, 102, 103, 108, 111.60, 21</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГТ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияГТ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРаспоряжения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаспоряженияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Enums/ТипыДрагМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДрагМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеКамни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ИнвентаризацияДрагКамнейВИК/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ВыборОСОбработан;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыИнвентаризация();
	УстановитьВидимостьЭлементов(ЭтаФорма);
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Подразделение = Справочники.Подразделения.ПустаяСсылка();
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ДоступностьСвязанныхРеквизитовОрганизации();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "СозданиеДокументов" И Источник = ЭтаФорма Тогда
		АдресВХранилище = Параметр;
		Модифицированность = Истина;
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	УстановитьДоступностьЭлементов();
	УстановитьВидимостьЭлементов(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыИнвентаризация();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	УстановитьДоступностьЭлементов();
	УстановитьВидимостьЭлементов(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыИнвентаризация();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ДоступностьСвязанныхРеквизитовОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ПроцедурыПодсистемыИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнвентаризация

&НаКлиенте
Процедура ИнвентаризацияДрагКамниНФАПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыИнвентаризация();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииПередНачаломИзменения(Элемент, Отказ)
	Отказ = НЕ РазрешеноРедактированиеОбъекта(Объект);
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ОбработатьПодборКомиссии(	Объект,
																	ЭтаФорма, 
																	ВыбранноеЗначение, 
																	СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура КомандаЗаполнитьПоБУ(Команда)
	
	Если НЕ РазрешеноРедактированиеОбъекта(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Если НельзяДобавитьВТЧИнвентаризация() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Инвентаризация.Количество() > 0 Тогда
		ТекстВопроса = 
		НСтр("ru = 'При заполнении по данным учета может измениться состав таблицы ""Инвентаризация"":
					|	- будут удалены объекты отсутствующие в учете и по фактическим данным,
					|	- будут добавлены объекты по которым есть данные в учете.
					|Продолжить заполнение с изменением таблицы ""Инвентаризация""?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить заполнение'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		Ответ = Неопределено;

		
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗаполнитьПоБУЗавершение", ЭтотОбъект), ТекстВопроса, Кнопки, 15, КодВозвратаДиалога.Отмена);
		Возврат;
	КонецЕсли;
	
	КомандаЗаполнитьПоБУФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьДанныеБУ(Команда)
	
	Если НЕ РазрешеноРедактированиеОбъекта(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Если НельзяДобавитьВТЧИнвентаризация() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуИнвентаризацияПоБУ(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьФУпоБУ(Команда)
	
	Если НЕ РазрешеноРедактированиеОбъекта(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьФУпоБУ();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьКомиссию(Команда)
	
	Если НЕ РазрешеноРедактированиеОбъекта(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	ИнвентаризацияКлиент.ОткрытьВыборКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьПредседателя(Команда)
	
	Если НЕ РазрешеноРедактированиеОбъекта(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ИнвентаризацияКлиент.ОткрытьВыборПредседателяКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьЧленовКомиссии(Команда)
	
	Если НЕ РазрешеноРедактированиеОбъекта(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ИнвентаризацияКлиент.ОткрытьПодборКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик выбора строки постоянно действующией комиссии. см.ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии.
// "Объект" передается явно, без этого данные объекта не заполняются в web-клиенте.
&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект)	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоБУЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	КомандаЗаполнитьПоБУФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоБУФрагмент()
	
	ЗаполнитьТаблицуИнвентаризацияПоБУ();
	
	Если Объект.Инвентаризация.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Нет данных для заполнения инвентаризации'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИнвентаризацияПоУчетуИНВ9(МассивЦМО, МассивДрагМатериалов, ТолькоПересчитать = Ложь)
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОсновноеСредство
			|ПОМЕСТИТЬ СписокОС
			|ИЗ
			|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
			|			&Период,
			|			Счет В (&МассивСчетовОС),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
			|			Организация = &Организация
			|				И &ПодразделенияНет) КАК ЖурналПроводокЕПСБУОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОбъектНФА,
			|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	СтоимостьОбъектовОСОстатки.КоличествоОстаток КАК Количество
			|ПОМЕСТИТЬ ДанныеОСВсе
			|ИЗ
			|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И &ПодразделенияНет
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС КАК СписокОС)) КАК СтоимостьОбъектовОСОстатки
			|ГДЕ
			|	СтоимостьОбъектовОСОстатки.КоличествоОстаток > 0
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ЖурналПроводокЕПСБУОстатки.Субконто1,
			|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
			|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт
			|ИЗ
			|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
			|			&Период,
			|			Счет В (&МассивСчетовМЗ),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
			|			Организация = &Организация
			|				И &ПодразделенияНет) КАК ЖурналПроводокЕПСБУОстатки
			|ГДЕ
			|	ЖурналПроводокЕПСБУОстатки.КоличествоОстаток > 0
			|
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЖурналПроводокЕПСБУОстатки.Субконто1,
			|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
			|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт
			|ИЗ
			|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
			|			&Период,
			|			Счет В ИЕРАРХИИ(&МассивСчетовМЦ),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.МатериальнаяЦенность),
			|			Организация = &Организация
			|				И &ПодразделенияНет) КАК ЖурналПроводокЕПСБУОстатки
			|ГДЕ
			|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОбъектНФА,
			|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвентарныйНомер,
			|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт КАК Количество,
			|	0 КАК ТипОбъектаНФА
			|ПОМЕСТИТЬ ДанныеМЗНеИК
			|ИЗ
			|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&МассивСчетовМЗНеИК), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура), Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
			|ГДЕ
			|	ЖурналПроводокЕПСБУОстатки.КоличествоОстаток > 0"
			+
			УчетДрагМатериалов.ДополнитьТекстЗапросаИнвентаризацияПоУчетуИНВИК()
			+
			"ВЫБРАТЬ
			|	ДанныеОС.ОбъектНФА КАК ОбъектНФА,
			|	ДанныеОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	ВЫБОР
			|		КОГДА ДанныеОС.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
			|			ТОГДА ДанныеОС.Количество
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Количество,
			|	ВЫБОР
			|		КОГДА ДанныеОС.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
			|			ТОГДА ЕСТЬNULL(ДанныеОСВсе.Количество, 1) + ЕСТЬNULL(ДанныеМЗНеИК.Количество, 0)
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КоличествоВсего
			|ПОМЕСТИТЬ ПолныеДанныеОС
			|ИЗ
			|	ДанныеОС КАК ДанныеОС
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОСВсе КАК ДанныеОСВсе
			|		ПО (ДанныеОСВсе.ОбъектНФА = ДанныеОС.ОбъектНФА)
			|			И (ДанныеОСВсе.ИнвентарныйНомер = ДанныеОС.ИнвентарныйНомер)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеМЗНеИК КАК ДанныеМЗНеИК
			|		ПО ДанныеОС.ОбъектНФА = ДанныеМЗНеИК.ОбъектНФА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеОС.ОбъектНФА КАК ОбъектНФА,
			|	ДанныеОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	ДанныеОС.Количество КАК Количество,
			|	ДанныеОС.КоличествоВсего КАК КоличествоВсего,
			|	НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК ВидДрагМатериала,
			|	ВЫРАЗИТЬ((ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток КАК ЧИСЛО(17, 8))) * (ВЫРАЗИТЬ(ДанныеОС.Количество КАК ЧИСЛО(17, 8))) / (ВЫРАЗИТЬ(ДанныеОС.КоличествоВсего КАК ЧИСЛО(17, 8))) КАК ЧИСЛО(17, 8)) КАК МассаДМУчет,
			|	ВЫРАЗИТЬ((ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.КоличествоДМОстаток КАК ЧИСЛО(17, 8))) * (ВЫРАЗИТЬ(ДанныеОС.Количество КАК ЧИСЛО(17, 8))) / (ВЫРАЗИТЬ(ДанныеОС.КоличествоВсего КАК ЧИСЛО(17, 8))) КАК ЧИСЛО(17, 8)) КАК КоличествоДМУчет,
			|	ВЫБОР
			|		КОГДА ДанныеОС.ОбъектНФА ССЫЛКА Справочник.Номенклатура
			|			ТОГДА ДанныеОС.ОбъектНФА.ЕдиницаИзмерения
			|		ИНАЧЕ &ЕдиницаИзмерения
			|	КОНЕЦ КАК ЕдиницаИзмерения,
			|	НаличиеДрагМатериаловВОбъектахНФАОстатки.ЕдИзм КАК ЕдиницаИзмеренияДрагМатериала
			|ПОМЕСТИТЬ ДанныеВУчетныхЕдиницах
			|ИЗ
			|	ПолныеДанныеОС КАК ДанныеОС
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки(
			|				&Период,
			|				Организация = &Организация
			|					И ВидДрагМатериала В (&МассивДрагМатериалов)) КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
			|		ПО ДанныеОС.ОбъектНФА = НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА
			|			И ДанныеОС.ИнвентарныйНомер = НаличиеДрагМатериаловВОбъектахНФАОстатки.ИнвНомер
			|ГДЕ
			|	НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НастройкиЕдиницИзмеренияДрагМатериалов.УчетнаяЕдиницаИзмерения КАК УчетнаяЕдиницаИзмерения,
			|	НастройкиЕдиницИзмеренияДрагМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	НастройкиЕдиницИзмеренияДрагМатериалов.Коэффициент КАК Коэффициент
			|ПОМЕСТИТЬ НастройкиЕдиницУчета
			|ИЗ
			|	РегистрСведений.НастройкиЕдиницИзмеренияДрагМатериалов КАК НастройкиЕдиницИзмеренияДрагМатериалов
			|ГДЕ
			|	НастройкиЕдиницИзмеренияДрагМатериалов.ЕдиницаИзмерения = &Караты
			|	И НастройкиЕдиницИзмеренияДрагМатериалов.Организация = &Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеВУчетныхЕдиницах.ОбъектНФА КАК ОбъектНФА,
			|	ДанныеВУчетныхЕдиницах.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	ДанныеВУчетныхЕдиницах.Количество КАК Количество,
			|	ДанныеВУчетныхЕдиницах.ВидДрагМатериала КАК ВидДрагМатериала,
			|	ВЫРАЗИТЬ(ДанныеВУчетныхЕдиницах.МассаДМУчет * ВЫБОР
			|			КОГДА НастройкиЕдиницУчета.Коэффициент ЕСТЬ NULL
			|				ТОГДА 1
			|			КОГДА НастройкиЕдиницУчета.Коэффициент = 0
			|				ТОГДА 1
			|			ИНАЧЕ НастройкиЕдиницУчета.Коэффициент
			|		КОНЕЦ КАК ЧИСЛО(17, 8)) КАК МассаДМУчет,
			|	ДанныеВУчетныхЕдиницах.КоличествоДМУчет КАК КоличествоДМУчет,
			|	ДанныеВУчетныхЕдиницах.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ДанныеВУчетныхЕдиницах.ЕдиницаИзмеренияДрагМатериала КАК ЕдиницаИзмеренияДрагМатериала,
			|	ДанныеВУчетныхЕдиницах.КоличествоВсего КАК КоличествоВсего
			|ПОМЕСТИТЬ ДанныеПоДМ
			|ИЗ
			|	ДанныеВУчетныхЕдиницах КАК ДанныеВУчетныхЕдиницах
			|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиЕдиницУчета КАК НастройкиЕдиницУчета
			|		ПО ДанныеВУчетныхЕдиницах.ЕдиницаИзмеренияДрагМатериала = НастройкиЕдиницУчета.УчетнаяЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеПоДМ.ОбъектНФА КАК ОбъектНФА,
			|	ДанныеПоДМ.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	СУММА(ДанныеПоДМ.Количество) КАК Количество,
			|	ДанныеПоДМ.ВидДрагМатериала КАК ВидДрагМатериала,
			|	СУММА(ДанныеПоДМ.МассаДМУчет) КАК МассаДМУчет,
			|	СУММА(ДанныеПоДМ.КоличествоДМУчет) КАК КоличествоДМУчет,
			|	ДанныеПоДМ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ДанныеПоДМ.ЕдиницаИзмеренияДрагМатериала КАК ЕдиницаИзмеренияДрагМатериала,
			|	СУММА(ДанныеПоДМ.КоличествоВсего) КАК КоличествоВсего
			|ИЗ
			|	ДанныеПоДМ КАК ДанныеПоДМ
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеПоДМ.ОбъектНФА,
			|	ДанныеПоДМ.ИнвентарныйНомер,
			|	ДанныеПоДМ.ВидДрагМатериала,
			|	ДанныеПоДМ.ЕдиницаИзмерения,
			|	ДанныеПоДМ.ЕдиницаИзмеренияДрагМатериала";			
			
			
	МассивСчетовОС = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляИК();
	
	МассивСчетовМЗ = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляМЗИК();
	МассивСчетовМЗНеИК = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляМЗ();
	
	МассивСчетовМЦ = БухгалтерскийУчет.СписокСчетов("МЦК");
	
	МассивСубконтоОС = Новый Массив;
	МассивСубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	
	МассивСубконтоМЗ = Новый Массив;
	МассивСубконтоМЗ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	
	МассивСубконтоМЦ = Новый Массив;
	МассивСубконтоМЦ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	МассивСубконтоМЦ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.МатериальнаяЦенность);
	
	МассивСчетовКапвложенийИК = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляКапвложенийИК();
	
	МассивСубконтоКапвложений = Новый Массив;
	МассивСубконтоКапвложений.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	Если ЗначениеЗаполнено(Объект.ЦМО) Тогда
		МассивСубконтоКапвложений.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПодразделенияНет", "Подразделение = &Подразделение");
		Запрос.УстановитьПараметр("Подразделение",	Объект.Подразделение);
	Иначе
		Запрос.УстановитьПараметр("ПодразделенияНет",	Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЦМО) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтобратьКапвложенияПоЦМО", 
			"Субконто2 В (&МассивЦМО)");
		Запрос.УстановитьПараметр("МассивЦМО", МассивЦМО);
  	Иначе
		Запрос.УстановитьПараметр("ОтобратьКапвложенияПоЦМО", Истина);	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", 					ИнвентаризацияКлиентСервер.ПолучитьДатуОпределенияОстатков52н(Объект.ДатаИнвентаризации));
	Запрос.УстановитьПараметр("Организация",				Объект.Организация);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",			УчетДрагМатериалов.Штуки());
	Запрос.УстановитьПараметр("МассивСчетовОС",				МассивСчетовОС);
	Запрос.УстановитьПараметр("МассивСчетовМЗ",				МассивСчетовМЗ);
	Запрос.УстановитьПараметр("МассивСчетовМЗНеИК",			МассивСчетовМЗНеИК);
	Запрос.УстановитьПараметр("МассивСчетовМЦ",				МассивСчетовМЦ);
	Запрос.УстановитьПараметр("МассивСубконтоОС",			МассивСубконтоОС);
	Запрос.УстановитьПараметр("МассивСубконтоМЗ",			МассивСубконтоМЗ);
	Запрос.УстановитьПараметр("МассивСубконтоМЦ",			МассивСубконтоМЦ);
	Запрос.УстановитьПараметр("МассивСчетовКапвложенийИК",	МассивСчетовКапвложенийИК);
	Запрос.УстановитьПараметр("МассивСубконтоКапвложений",	МассивСубконтоКапвложений);
	Запрос.УстановитьПараметр("МассивДрагМатериалов",		МассивДрагМатериалов);
	Запрос.УстановитьПараметр("Караты",						УчетДрагМатериалов.Караты());
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.Инвентаризация.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуИнвентаризацияПоБУ(ТолькоПересчитать = Ложь)
	
	МассивЦМО = МассивЦМО();
	МассивДМ = МассивДМ();
	
	ЗаполнитьТаблицуИнвентаризацияПоУчетуИНВ9(МассивЦМО, МассивДМ, ТолькоПересчитать);
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыИнвентаризация();
	
КонецПроцедуры // ЗаполнитьТаблицуИнвентаризацияПоБУ()

&НаСервере
Функция МассивЦМО()
	
	МассивЦМО = Новый Массив;
	Если ТипЗнч(Объект.ЦМО) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗапросМОЛ = Новый Запрос;
		ЗапросМОЛ.Текст = "ВЫБРАТЬ
		                  |	ЦМО.Ссылка
		                  |ИЗ
		                  |	Справочник.ЦМО КАК ЦМО
		                  |ГДЕ
		                  |	ЦМО.Сотрудник = &Сотрудник
		                  |	И ЦМО.ПометкаУдаления = ЛОЖЬ";
					
		ЗапросМОЛ.УстановитьПараметр("Сотрудник", Объект.ЦМО);
		РезультатЗапросаМОЛ = ЗапросМОЛ.Выполнить();
		Выборка = РезультатЗапросаМОЛ.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивЦМО.Добавить(Выборка.Ссылка);
		КонецЦикла;	
	ИначеЕсли ТипЗнч(Объект.ЦМО) = Тип("СправочникСсылка.ЦМО") Тогда	
		МассивЦМО.Добавить(Объект.ЦМО);
	КонецЕсли;	
	
	Возврат МассивЦМО;
КонецФункции	

&НаСервере
Функция МассивДМ()
	ТипДМ = Перечисления.ТипыДрагМатериалов.ДрагоценныеКамни;
	
	МассивДМ = Новый Массив;
	Если ЗначениеЗаполнено(Объект.ОтборДрагоценныйМатериал) Тогда
		Если Объект.ОтборДрагоценныйМатериал.ЭтоГруппа Тогда
			МассивДМ = УчетДрагМатериалов.МассивДрагМатериалов(ТипДМ, Объект.ОтборДрагоценныйМатериал);
		Иначе	
			МассивДМ.Добавить(Объект.ОтборДрагоценныйМатериал);
		КонецЕсли;
	Иначе
		МассивДМ = УчетДрагМатериалов.МассивДрагМатериалов(ТипДМ);
	КонецЕсли;
	
	Возврат МассивДМ;	
КонецФункции	

&НаСервере
Процедура ПересчитатьФУпоБУ()

	ЗаблокироватьДанныеФормыДляРедактирования();
	
	Для каждого ТекущиеДанные Из Объект.Инвентаризация Цикл
		ТекущиеДанные.МассаДМФакт = ТекущиеДанные.МассаДМУчет;
		ТекущиеДанные.КоличествоДМФакт = ТекущиеДанные.КоличествоДМУчет;
	КонецЦикла; 	

КонецПроцедуры // ПересчитатьФУпоБУ()

&НаКлиенте
Функция НельзяДобавитьВТЧИнвентаризация()

	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
									НСтр("ru = 'Не заполнен обязательный реквизит ""Организация""'"),
									,
									"Объект.Организация",,Отказ);
	КонецЕсли;
	Возврат Отказ;							

КонецФункции // НельзяДобавитьВТЧИнвентаризация()

&НаКлиенте
Процедура ДоступностьСвязанныхРеквизитовОрганизации()

	ЗначениеДоступности = ЗначениеЗаполнено(Объект.Организация);
	Элементы.Подразделение.Доступность 	= ЗначениеДоступности;
	Элементы.ЦМО.Доступность			= ЗначениеДоступности;

КонецПроцедуры // ДоступностьСвязанныхРеквизитовОрганизации()

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	РазрешеноРедактированиеОбъекта = РазрешеноРедактированиеОбъекта(Объект)
									И ПравоДоступа("Изменение", Метаданные.Документы.ИнвентаризацияДрагМеталловВИК);

	МассивРеквизитовТолькоПросмотр = Новый Массив;
	МассивРеквизитовТолькоПросмотр.Добавить("Номер");
	МассивРеквизитовТолькоПросмотр.Добавить("Дата");
	МассивРеквизитовТолькоПросмотр.Добавить("Организация");
	МассивРеквизитовТолькоПросмотр.Добавить("Подразделение");
	МассивРеквизитовТолькоПросмотр.Добавить("ЦМО");
	МассивРеквизитовТолькоПросмотр.Добавить("НомерПриказа");
	МассивРеквизитовТолькоПросмотр.Добавить("ДатаПриказа");
	МассивРеквизитовТолькоПросмотр.Добавить("ДолжностьПредседателяКомиссии");
	МассивРеквизитовТолькоПросмотр.Добавить("ФамилияПредседателяКомиссии");
	МассивРеквизитовТолькоПросмотр.Добавить("ИмяПредседателяКомиссии");
	МассивРеквизитовТолькоПросмотр.Добавить("ОтчествоПредседателяКомиссии");
	МассивРеквизитовТолькоПросмотр.Добавить("НомерПриказаИнвентаризации");
	МассивРеквизитовТолькоПросмотр.Добавить("ДатаПриказаИнвентаризации");
	МассивРеквизитовТолькоПросмотр.Добавить("ДатаНачала");
	МассивРеквизитовТолькоПросмотр.Добавить("ДатаОкончания");
	МассивРеквизитовТолькоПросмотр.Добавить("ПричинаИнвентаризации");
	МассивРеквизитовТолькоПросмотр.Добавить("МестоИнвентаризации");
	МассивРеквизитовТолькоПросмотр.Добавить("Комментарий");
	
	МассивРеквизитовТолькоПросмотр.Добавить("СоставКомиссии");
	МассивРеквизитовТолькоПросмотр.Добавить("Инвентаризация");
	
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(	Элементы, 
																		МассивРеквизитовТолькоПросмотр,
																		"ТолькоПросмотр",
																		НЕ РазрешеноРедактированиеОбъекта);
																		
КонецПроцедуры // УстановитьДоступностьЭлементов()

&НаКлиентеНаСервереБезКонтекста
Функция РазрешеноРедактированиеОбъекта(Объект)

	Если Объект.Проведен Тогда
		#Если НаКлиенте Тогда
		ТекстПредупреждения = НСтр("ru = 'Редактирование проведенного документа запрещено. 
										|Для изменения документа необходимо отменить проведение.'");
		ПоказатьПредупреждение(,ТекстПредупреждения, 15);
		#КонецЕсли
		Возврат Ложь;
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
		
	Возврат НЕ Объект.Проведен;

КонецФункции // РазрешеноРедактированиеОбъекта()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ИнвентаризацияДрагКамниНФАКоличествоЗаголовок.Видимость = Истина;
	Элементы.ИнвентаризацияДрагКамниНФАКоличествоДМУчет.Видимость = Истина;
	Элементы.ИнвентаризацияДрагКамниНФАКоличествоДМФакт.Видимость = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыИнвентаризация(ТекущаяСтрока)

	ТекущаяСтрока.КоличествоОбъектовНФАЗаголовок = НСтр("ru = 'Количество:'");
	ТекущаяСтрока.ЧистаяМассаЗаголовок = НСтр("ru = 'Масса (кар):'");
	ТекущаяСтрока.КоличествоЗаголовок = НСтр("ru = 'Количество (шт):'");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыИнвентаризация()

	Для Каждого ТекущаяСтрока Из Объект.Инвентаризация Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыИнвентаризация(ТекущаяСтрока);
	КонецЦикла;
		
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Если НаКлиенте Тогда 
ВыборОСОбработан = Ложь;
#КонецЕсли
